app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at DESC
---
	def index
		@posts = Post.all.order("created_at DESC")