app/controllers/posts_controller.rb

  def index
  	@posts = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

  def create
  	@post = Post.new(post_params)
  	if @post.save
---
INSERT INTO "posts" ("title", "body", "color", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Test"], ["body", "<p>addasdas</p>\r\n"], ["color", "#ffd707;"], ["slug", "test"], ["created_at", "2016-11-18 00:51:43.797406"], ["updated_at", "2016-11-18 00:51:43.797406"]]

  def update
  	if @post.update(post_params)
---
UPDATE "posts" SET "color" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["color", "#ffd707;"], ["updated_at", "2016-11-18 00:36:32.108459"], ["id", 1]]