app/controllers/projects_controller.rb

	def index
		@projects = Project.all.order("created_at desc")
---
SELECT "projects".* FROM "projects"  ORDER BY created_at desc

	def create
		@project =  Project.new project_params

		if @project.save
---
INSERT INTO "projects" ("title", "description", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "AIJSistem"], ["description", ""], ["slug", "aijsistem"], ["created_at", "2016-11-18 01:42:18.117662"], ["updated_at", "2016-11-18 01:42:18.117662"]]

	def find_project
		@project = Project.friendly.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]